{
  "awards": [
    {
      "id": "slherbsuedr",
      "name": "International GCSE Chinese: Grade 9 (top grade)",
      "organization": "Pearson",
      "date": "March 2021"
    },
    {
      "id": "sdtbsertrsb",
      "name": "Drums Rock and Pop Grade 8 (passed with distinction)",
      "organization": "Trinity College London",
      "date": "October 2020"
    }
  ],
  "education": [
    {
      "id": "slrubseibtrs",
      "institution": "The Chinese University Of Hong Kong",
      "year": "2021- ",
      "degree": "Bachelor of Engineering",
      "subject": "Computer Engineering"
    },
    {
      "id": "ehrgbksytts",
      "institution": "The HKU School of Professional and Continuing Education (HKU SPACE)", 
      "year": "2019-2021",
      "degree": "Associate of Engineering",
      "achievement": "Student on Principal's Honours List",
      "subject": "Computer Science Theme"
    },
    {
      "id": "skrvsyevuser",
      "institution": "SKH Bishop Mok Sau Tseng Secondary School",
      "year": "2013-2019",
      "degree": "HKDSE",
      "subject": "Physics, Economics, Geography"
    }
  ],
  "experiences": [
    {
      "id": "slrbvseibuirs",
      "name": "Warehouse Worker",
      "company": "Li Fung Group",
      "period": "Jul 2019"
    },
    {
      "id": "sdhbousht9rdr",
      "name": "Shop Assistant",
      "company": "Tai Yuen Groceries",
      "period": "Jul 2019 - Sept 2019"
    },
    {
      "id": "setbhrltiudsrt",
      "name": "Shop Assistant",
      "company": "Tsui Yi Groceries",
      "period": "Nov 2019 - Jan 2019"
    },
    {
      "id": "lfiymnitnrytg",
      "name": "Frontend Developer Intern",
      "company": "Carnot Innovations Limited",
      "period": "Jun 2020 - Aug 2020",
      "content": "For the first half of the internship, I took part in data analysis on 6 different buildings in Central, Hong Kong. I gained experience in generating data reports. For the second half of the internship, I returned to my original role for web development. I assisted in the development of private websites for 2 of the mentioned 6 buildings, and display the data trends of each sensor within a period of time. I gained advanced knowledge in web development and project.", 
      "tools": "Data Science: DBeaver, Anaconda, Pycharm, Jupyter Notebook. Web Development: GitHub, Laragon, Vue CLI, Plotly.js, Vue.js. Project Management: Slack"
    },
    {
      "id": "ljiebsrbnserno",
      "name": "Private Tutor",
      "company": "Independent",
      "period": "Feb 2021 - Apr 2021"
    },
    {
      "id": "drnbdrntiosrny",
      "name": "Frontend Developer Intern",
      "company": "Carnot Innovations Limited",
      "period": "Jun 2021 - Aug 2021",
      "content": "I refactored hard-coded components with Plotly.js data charts into fully customisable widgets. I also added search filters and updating loading methods for outdated pages. At last, I created a path splitting algorithm to a point mapping page for the team's fellow data scientists to upload, configure, and download CSV points lists, with auto-suggestions for sensors and sensor names referencing a dictionary.",
      "tools": "Backend Integreation: DBeaver, Anaconda, Pycharm, Jupyter Notebook, Flask. Web Development: GitHub, Laragon, Vue CLI, Plotly.js, Vue.js. Project Management: Slack, Notion"
    }
  ],
  "homepage": [
    {
      "id": "sbfvsueirvbse",
      "text": "I am a student enrolled in the Computer Engineering programme of the Chinese University of Hong Kong. "
    }
  ],
  "interests": [
    {
      "id": "bulidtt6e64tr",
      "name": "Drums",
      "description": "I have 15 years of experience in drumming, and I recieved the certificate of Grade 8 in drums with distinction by Trinity College London (Rock and Pop). My focus is on progressive rock and punk rock music, which emphasizes on the power, speed and accuracy. I have done drum covers of Rush and Green Day, which suits my drumming style.",
      "image": "require('../assets/drums.png')",
      "alt": "Drumming"
    },
    {
      "id": "dfljnbidtyty",
      "name": "Football",
      "description": "I have watched football for 17 years, playing it for 8 years. I play as a centre back, and my strengths are tackling, interceptions and headers. My style of play is very aggressive and ruthless which frequently resulted in fouls. I am an avid supporter of Chelsea F.C and my football idols include John Terry, Tony Adams and Paolo Maldini."
    },
    {
      "id": "htliidytnrftn",
      "name": "WWII History",
      "description": "I am deeply interested in war history, particularly between the period of 1914-1945. I would do research on Adolf Hitler, the greatest of evil in the 21st century, and look into the roots of his ideals and how he created a murderous regime. These readings enhances my logical reasoning and critical thinking, and learn not to seperate the intertwined relationship between political, social, and economic aspects of every decision.",
      "image": "../assets/book.jpg",
      "alt": "History Books"
    },
    {
      "id": "dflijnduirtbtr",
      "name": "Programming",
      "description": "Since the start of college, I have invested a lot of time in programming. I learnt the basic concepts of Python and Java, and I have self-taught HTML, CSS and JavaScript. I enjoy the process of breaking down a problematic idea into small chunks, and when I solve them, I feel very motivated. I am currently learning advanced JavaScript and will take classes of C++ for my bachelors degree."
    }
  ],
  "introduction": [
    {
      "id": "ajenraerndf",
      "text": "I am a year 2 student currently enrolled in the Associate of Engineering (Computer Science) from HKU SPACE. I have been admitted to the Bachelor of Engineering (Computer Engineering) programme of CUHK for the upcoming semester. I take pleasure from web development, having hands-on experience on web development in the last summer at Carnot Innovations Limited. I would also like to take part in other roles in the IT industry, primarily related to software engineering. I have acquired several important skills through my internship and projects, including UX/UI design for web and mobile users, and intermediate levels on the usage of NoSQL databases and REST APIs. Though I have experience in frontend design, I would also like to get my hands on backend operations. I have several hobbies, including playing football, drums (achieving Trinity College Rock & Pop grade 8 pass with distinction), and reading books on 1914-1945 war history."
    }
  ],
  "learnings": [
    {
      "id": "awrgbiluear",
      "title": "Introduction to Computer Programming",
      "institute": "HKU SPACE",
      "period": "Year 1 Semester 1",
      "description": "This is an introductory course to programming in Python. Course teaching includes data types, variables, strings, flow Control, selections, loops, functions, lists and tuples, data file I/O, dictionaries, and a mini I/O project of a shopping order into a .txt file"
    },
    {
      "id": "awlbrviuaweb",
      "title": "Computer Architecture",
      "institute": "HKU SPACE",
      "period": "Year 1 Semester 1",
      "description": "This course includes the introduction to number representation formats, basic knowledge to digital logic, logic manipulation and memory control"
    },
    {
      "id": "aekrgbuaerig",
      "title": "Intorduction to Engineering",
      "institute": "HKU SPACE",
      "period": "Year 1 Semester 2",
      "description": "This course includes basic engineering physics in mechanics and electromagnetism, data chart display via Octave, signal and network systems"
    },
    {
      "id": "aelignlshrt",
      "title": "Introduction to Data Stuctures and Algorithms",
      "institute": "HKU SPACE",
      "period": "Year 1 Semester 2",
      "description": "This course is an extension to Introduction to Computer Programming, it includes lists, stacks and queues manipulation, binary tree and graph calculations, and searching and sorting methodologies."
    },
    {
      "id": "aergbilauergbi",
      "title": "Mathematics to Computing",
      "institute": "HKU SPACE",
      "period": "Year 2 Semester 1",
      "description": "Also known as discrete mathematics. Materials include basic logic, set theorem and functions, mathimatical induction and recursion, counting and discrete probability, and graph theory."
    },
    {
      "id": "drinlbdtsjgbn",
      "title": "Object-Oriented Programming",
      "institute": "HKU SPACE",
      "period": "Year 2 Semester 1",
      "description": "This is a introductory course to Java. It includes every feature from the Introduction to Computer Programming course plus class features, exception handling and GUI programming"
    },
    {
      "id": "dfbndltjon",
      "title": "Internet Programming",
      "institute": "HKU SPACE",
      "period": "Year 2 Semester 1",
      "description": "This course introduces HTML, CSS and JavaScript for frontend programming. It also provides a breif introduction to Bootstrap, ASP, PHP, and some principles of software engineering."
    },
    {
      "id": "gfbndtoidiyb",
      "title": "Project on Knowledge Products Developement",
      "institute": "HKU SPACE",
      "period": "Year 2",
      "description": "This is a final year project course. Teachings included students proposing their pwon project ideas and integrating them and report to their supervisor every two weeks, recording progress and their product cycle."
    },
    {
      "id": "udrnitbinuntiu",
      "title": "Introduction to Database Systems",
      "institute": "HKU SPACE",
      "period": "Year 2 Semester 2",
      "description": "This course focuses on SQL database modelling via Apache OpenOffice. Content includes modelling, normalization, SQL commands, NOSQL databases. It also contains a project where a stock list of shoe purchases has to be store in the database."
    },
    {
      "id": "srtbnruikti",
      "title": "Introduction to Computer Organisation",
      "institute": "HKU SPACE",
      "period": "Year 2 Semester 2",
      "description": "This course serves as an extension to the Introduction to Digital Logic Circuits course. It introduced the use of assembly language and the usage of intruction sets, the features of single and multiple cycle processors and pipelining"
    },
    {
      "id": "jafbuisenib",
      "title": "Problem Solving by Programming",
      "institute": "CUHK",
      "period": "Year 1 Semester 1",
      "description": "An introductory course to the C language"
    }
  ],
  "projects": [
    {
      "id": "dflutbdrtrlhd",
      "name": "YouTeam - Team Management for YouTuber Groups",
      "description": "A final-year project as a CS student at HKU SPACE. Gained intermediate experience with authentication, NoSQL databases, state management, RESTful API, and web hosting.",
      "route": "https://fyp-website-3f6ab.web.app/login",
      "redirect": true,
      "tools": "Firebase, Vuex, Plotly.js, YouTube Data API"
    },
    {
      "id": "haebuw3lrivae",
      "name": "Simple Reaction Timer",
      "description": "A simple reaction timer for me to learn/refresh the features of Vue 3. This project mainly displays my skills on event handling, where users can react at different intervals to get different results popped up on the screen.",
      "route": "/projects/reaction-timer",
      "redirect": false,
      "tools": "Vue 3"
    },
    {
      "id": "setbserbsesb4",
      "name": "File Reader",
      "description": "A page for users to import Excel or CSV files and display basic details in a data table",
      "route": "/projects/file-reader",
      "redirect": false,
      "tools": "NPM packages: readXlsxFile, PapaParse"
    },
    {
      "id": "rtbeterbgfbrtsb",
      "name": "Linear Motion Converter",
      "description": "A page for users to input 3 parameters for linear motion, and displays the rest of the parameters",
      "route": "/projects/linearmotionconverter",
      "redirect": false,
      "tools": "Basic Vue Methods"
    },
    {
      "id": "zdbnsrthdrhthn",
      "name": "Current Weather of a City",
      "description": "A page for users to input a valid city name and displays the current weather details",
      "route": "/projects/cityweather",
      "redirect": false,
      "tools": "openweathermap.org API"
    },
    {
      "id": "fsgtnbsrftnbsrs",
      "name": "F1 Live Standings and Results",
      "description": "A page to display current Formula 1 standings",
      "route": "/projects/f1live",
      "redirect": false,
      "tools": "Rapid API's F1 Live Motorsport Data API"
    },
    {
      "id": "sRVBrbzdbvfzdfbz",
      "name": "API tester",
      "description": "A page to test my APIS",
      "route": "/projects/apis",
      "redirect": false,
      "tools": "Google Maps API"
    },
    {
      "id": "srlibseiubudb",
      "name": "COVID searcher",
      "description": "A page to search for COVID cases for a country",
      "route": "/projects/covid",
      "redirect": false,
      "tools": "COVID-19 data API"
    }
  ]
}